#########################################################################
# File Name: s12_testnet.sh
# Author: Crow
# mail:qnglsk@163.com
# Created Time: 2020年03月26日 星期四 16时51分37秒
#########################################################################
#!/bin/bash

# 编写脚本测试 192.168.4.0/24 整个网段中哪些主机处于开机状态,哪些主机处于关机状态(for 版本)

# 编写脚本测试 192.168.4.0/24 整个网段中哪些主机处于开机状态,哪些主机处于关机

# 状态(for 版本)

for i in {1..254}
do
	# 每隔0.3秒 ping 一次，一共 ping 2次，并以 1毫秒 为单位 设置 ping 的超时时间
	ping -c2 -i0.3 -W 1 192.168.4.$i &>/dev/null
	if [ $? -eq 0 ];then
		echo "192.168.4.$i is up"
	else
		echo "192.168.4.$i is down"
	fi
done
