#########################################################################
# File Name: s29_chessplate.sh
# Author: Crow
# mail:qnglsk@163.com
# Created Time: 2020年03月30日 星期一 14时53分12秒
#########################################################################
#!/bin/bash

# 打印国际象棋棋盘


# 设置两个变量,i 和 j,一个代表行,一个代表列,国际象棋为 8*8 棋盘

# i=1 是代表准备打印第一行棋盘,第 1 行棋盘有灰色和蓝色间隔输出,总共为 8 列

# i=1,j=1 代表第 1 行的第 1 列;i=2,j=3 代表第 2 行的第 3 列

# 棋盘的规律是 i+j 如果是偶数,就打印蓝色色块,如果是奇数就打印灰色色块

# 使用 echo ‐ne 打印色块,并且打印完成色块后不自动换行,在同一行继续输出其他色块

for i in {1..8}

do

	for j in {1..8}

	do

		sum=$[i+j]

		if [ $[sum%2] -eq 0 ];then

			echo -ne "\033[46m \033[0m"
			
		else
			
			echo -ne "\033[47m \033[0m"
			
		fi
		
	done
	
	echo
	
done
