#########################################################################
# File Name: s98_doubleball.sh
# Author: Crow
# mail:qnglsk@163.com
# Created Time: 2020年05月22日 星期五 15时47分21秒
#########################################################################
#!/bin/bash

# 统计双色球各个数字的中奖概率

# 往期双色球中奖号码如下:

# 01 04 11 28 31 32 16

# 04 07 08 18 23 24 02

# 02 05 06 16 28 29 04

# 04 19 22 27 30 33 01

# 05 10 18 19 30 31 03

# 02 06 11 12 19 29 06

# 统计篮球和红球数据出现的概率次数(篮球不分顺序,统计所有篮球混合在一起的概率)

awk '{print $1"\n"$2"\n"$3"\n"$4"\n"$5"\n"$6}' 1.txt | sort | uniq -c | sort

awk '{print $7}' 1.txt | sort | uniq -c | sort
# 前6列是篮球,最后一列是红球?
